using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "ВидыОперацийПоЗарплате", Comment = "", Synonym = "Виды операций по зарплате")]
    public enum ВидыОперацийПоЗарплате
    {
        [Description1C8(Name = "НачисленоДоход", Comment = "", Synonym = "Начислено")]
        НачисленоДоход,
        [Description1C8(Name = "НачисленоБольничные", Comment = "", Synonym = "Начислено больничные за счет предприятия")]
        НачисленоБольничные,
        [Description1C8(Name = "НачисленоОтпускныеДоход", Comment = "", Synonym = "Начислено отпускные")]
        НачисленоОтпускныеДоход,
        [Description1C8(Name = "НачисленоОтпускныеРезерв", Comment = "", Synonym = "Начислено отпускные (за счет резерва отпусков)")]
        НачисленоОтпускныеРезерв,
        [Description1C8(Name = "ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок", Comment = "", Synonym = "Возврат излишне выплаченных суммы вследствие счетных ошибок")]
        ВозвратИзлишнеВыплаченныхСуммВследствиеСчетныхОшибок,
        [Description1C8(Name = "ВозмещениеУщерба", Comment = "", Synonym = "Возмещение ущерба")]
        ВозмещениеУщерба,
        [Description1C8(Name = "ВознаграждениеПлатежногоАгента", Comment = "", Synonym = "Вознаграждение платежного агента")]
        ВознаграждениеПлатежногоАгента,
        [Description1C8(Name = "ВыплатыБывшимСотрудникам", Comment = "", Synonym = "Выплаты бывшим сотрудникам")]
        ВыплатыБывшимСотрудникам,
        [Description1C8(Name = "НатуральныйДоход", Comment = "", Synonym = "Доходы в натуральной форме")]
        НатуральныйДоход,
        [Description1C8(Name = "Дивиденды", Comment = "", Synonym = "Дивиденды")]
        Дивиденды,
        [Description1C8(Name = "НачисленоСдельноДоход", Comment = "", Synonym = "Начислено (сдельно)")]
        НачисленоСдельноДоход,
        [Description1C8(Name = "НачисленоЗаСчетФССДоход", Comment = "", Synonym = "Начислено за счет ФСС")]
        НачисленоЗаСчетФССДоход,
        [Description1C8(Name = "ДивидендыСотрудников", Comment = "", Synonym = "Дивиденды сотрудников")]
        ДивидендыСотрудников,
        [Description1C8(Name = "ДоговорАвторскогоЗаказа", Comment = "", Synonym = "Договор авторского заказа")]
        ДоговорАвторскогоЗаказа,
        [Description1C8(Name = "ДоговорРаботыУслуги", Comment = "", Synonym = "Договор (работы, услуги)")]
        ДоговорРаботыУслуги,
        [Description1C8(Name = "ДоходыКонтрагентов", Comment = "", Synonym = "Доходы контрагентов")]
        ДоходыКонтрагентов,
        [Description1C8(Name = "ДСВ", Comment = "", Synonym = "ѳ(не украинский) Добровольные взносы на накопительную часть пенсии")]
        ДСВ,
        [Description1C8(Name = "МатериальнаяПомощь", Comment = "", Synonym = "Материальная помощь")]
        МатериальнаяПомощь,
        [Description1C8(Name = "АлиментыПрочиеИсполнительныеЛисты", Comment = "", Synonym = "Алименты и прочие исполнительные листы")]
        АлиментыПрочиеИсполнительныеЛисты,
        [Description1C8(Name = "ИсполнительныеЛисты", Comment = "", Synonym = "Исполнительные листы")]
        ИсполнительныеЛисты,
        [Description1C8(Name = "ПочтовыйСбор", Comment = "", Synonym = "Почтовый сбор")]
        ПочтовыйСбор,
        [Description1C8(Name = "ПогашениеЗаймов", Comment = "", Synonym = "Погашение займов")]
        ПогашениеЗаймов,
        [Description1C8(Name = "НачисленоПроцентовПоЗайму", Comment = "", Synonym = "Начислено процентов по займу")]
        НачисленоПроцентовПоЗайму,
        [Description1C8(Name = "ПроцентыПоЗайму", Comment = "", Synonym = "Проценты по займу")]
        ПроцентыПоЗайму,
        [Description1C8(Name = "КомпенсацияЗаЗадержкуЗарплаты", Comment = "", Synonym = "Компенсация за задержку зарплаты")]
        КомпенсацияЗаЗадержкуЗарплаты,
        [Description1C8(Name = "ПрочиеУдержания", Comment = "", Synonym = "Прочие удержания")]
        ПрочиеУдержания,
        [Description1C8(Name = "НДФЛДоначисленныйПоРезультатамПроверки", Comment = "", Synonym = "НДФЛ, доначисленный по результатам проверки")]
        НДФЛДоначисленныйПоРезультатамПроверки,
        [Description1C8(Name = "НДФЛДоходыКонтрагентов", Comment = "", Synonym = "НДФЛ с доходов контрагентов")]
        НДФЛДоходыКонтрагентов,
        [Description1C8(Name = "НДФЛПередачаЗадолженностиВНалоговыйОрган", Comment = "", Synonym = "НДФЛ передача задолженности в налоговый орган")]
        НДФЛПередачаЗадолженностиВНалоговыйОрган,
        [Description1C8(Name = "НДФЛПрочиеРасчетыСПерсоналом", Comment = "", Synonym = "НДФЛ с доходов по прочим операциям с персоналом")]
        НДФЛПрочиеРасчетыСПерсоналом,
        [Description1C8(Name = "НДФЛРасчетыСБывшимиСотрудниками", Comment = "", Synonym = "НДФЛ расчеты с бывшими сотрудниками")]
        НДФЛРасчетыСБывшимиСотрудниками,
        [Description1C8(Name = "НФДЛДивиденды", Comment = "", Synonym = "НДФЛ с дивидендов")]
        НФДЛДивиденды,
        [Description1C8(Name = "НФДЛДивидендыСотрудникам", Comment = "", Synonym = "НДФЛ с дивидендов работникам")]
        НФДЛДивидендыСотрудникам,
        [Description1C8(Name = "ОценкаОбязательстваИФормированиеРезервов", Comment = "", Synonym = "Оценка обязательства и формирование резервов")]
        ОценкаОбязательстваИФормированиеРезервов,
        [Description1C8(Name = "ДобровольныеВзносыВНПФ", Comment = "", Synonym = "ѳ(не украинский) Добровольные взносы в НПФ")]
        ДобровольныеВзносыВНПФ,
        [Description1C8(Name = "НачислениеЕСВРезерв", Comment = "", Synonym = "Начисление ЕСВ на ФОТ (за счет резерва отпусков)")]
        НачислениеЕСВРезерв,
        [Description1C8(Name = "Профвзносы", Comment = "", Synonym = "Профвзносы")]
        Профвзносы,
        [Description1C8(Name = "НачислениеЕСВ", Comment = "", Synonym = "Начисление ЕСВ на ФОТ")]
        НачислениеЕСВ,
        [Description1C8(Name = "НДФЛ", Comment = "", Synonym = "НДФЛ")]
        НДФЛ,
        [Description1C8(Name = "Депонирование", Comment = "", Synonym = "Депонирование зарплаты")]
        Депонирование,
        [Description1C8(Name = "ПФРДополнительныйТарифЛЭ", Comment = "", Synonym = "ѳ(не украинский) Взносы в ПФР (дополнительный тариф членов летных экипажей)")]
        ПФРДополнительныйТарифЛЭ,
        [Description1C8(Name = "ПФРДополнительныйТарифШахтеры", Comment = "", Synonym = "ѳ(не украинский) Взносы в ПФР (дополнительный тариф шахтеров)")]
        ПФРДополнительныйТарифШахтеры,
        [Description1C8(Name = "ПФРЗаЗанятыхНаПодземныхИВредныхРаботах", Comment = "", Synonym = "ѳ(не украинский) Взносы в ПФР (дополнительный тариф за занятых на работах с вредными условиями труда)")]
        ПФРЗаЗанятыхНаПодземныхИВредныхРаботах,
        [Description1C8(Name = "ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах", Comment = "", Synonym = "ѳ(не украинский) Взносы в ПФР (дополнительный тариф за занятых на работах с тяжелыми условиями труда)")]
        ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах,
        [Description1C8(Name = "ПФРНакопительнаяЧасть", Comment = "", Synonym = "ѳ(не украинский) Взносы в ПФР (накопительная часть)")]
        ПФРНакопительнаяЧасть,
        [Description1C8(Name = "ПФРСПревышения", Comment = "", Synonym = "ѳ(не украинский) ПФР - с базы сверх предельной величины")]
        ПФРСПревышения,
        [Description1C8(Name = "ПФРДоПредельнойВеличины", Comment = "", Synonym = "ѳ(не украинский) ПФР до предельной величины")]
        ПФРДоПредельнойВеличины,
        [Description1C8(Name = "ПФРПоСуммарномуТарифу", Comment = "", Synonym = "ѳ(не украинский) Взносы в ПФР (на ОПС)")]
        ПФРПоСуммарномуТарифу,
        [Description1C8(Name = "ПФРСтраховаяЧасть", Comment = "", Synonym = "ѳ(не украинский) Взносы в ПФР (страховая часть)")]
        ПФРСтраховаяЧасть,
        [Description1C8(Name = "РасходыПоСтрахованиюБюджет", Comment = "", Synonym = "Расходы по страхованию незастрахованным лицам")]
        РасходыПоСтрахованиюБюджет,
        [Description1C8(Name = "РасходыПоСтрахованиюРаботодатель", Comment = "", Synonym = "Расходы по страхованию за счет работодателя")]
        РасходыПоСтрахованиюРаботодатель,
        [Description1C8(Name = "РасходыПоСтрахованиюФСС", Comment = "", Synonym = "Расходы по страхованию ФСС")]
        РасходыПоСтрахованиюФСС,
        [Description1C8(Name = "РасходыПоСтрахованиюФССНС", Comment = "", Synonym = "Расходы по страхованию ФСС НС")]
        РасходыПоСтрахованиюФССНС,
        [Description1C8(Name = "СписаниеДепонента", Comment = "", Synonym = "Списание депонированной зарплаты в доходы организации")]
        СписаниеДепонента,
        [Description1C8(Name = "ТФОМС", Comment = "", Synonym = "ѳ(не украинский) ТФОМС")]
        ТФОМС,
        [Description1C8(Name = "УдержаниеЗаОтпуск", Comment = "", Synonym = "Удержание за отпуск")]
        УдержаниеЗаОтпуск,
        [Description1C8(Name = "УдержаниеНеизрасходованныхПодотчетныхСумм", Comment = "", Synonym = "Удержание неизрасходованных подотчетных сумм")]
        УдержаниеНеизрасходованныхПодотчетныхСумм,
        [Description1C8(Name = "УдержаниеПоПрочимОперациямСРаботниками", Comment = "", Synonym = "Удержание по прочим операциям с работниками")]
        УдержаниеПоПрочимОперациямСРаботниками,
        [Description1C8(Name = "ФСС", Comment = "", Synonym = "ФСС")]
        ФСС,
        [Description1C8(Name = "ФССНС", Comment = "", Synonym = "ФССНС")]
        ФССНС,
        [Description1C8(Name = "ФФОМС", Comment = "", Synonym = "ѳ(не украинский) ФФОМС")]
        ФФОМС,
        [Description1C8(Name = "ЕжегодныйОтпуск", Comment = "", Synonym = "Ежегодный отпуск")]
        ЕжегодныйОтпуск,
        [Description1C8(Name = "ЕжегодныйОтпускОценочныеОбязательства", Comment = "", Synonym = "Ежегодный отпуск за счет оценочных обязательств ")]
        ЕжегодныйОтпускОценочныеОбязательства,
        [Description1C8(Name = "ПФР", Comment = "", Synonym = "ѳ(не украинский) ПФР")]
        ПФР,
        [Description1C8(Name = "ФОМС", Comment = "", Synonym = "ѳ(не украинский) ФОМС")]
        ФОМС,
        [Description1C8(Name = "ЕжегодныйОтпускОценочныеОбязательстваИРезервыБУ", Comment = "", Synonym = "Отпуск за счет обязательств и резервов (БУ)")]
        ЕжегодныйОтпускОценочныеОбязательстваИРезервыБУ,
        [Description1C8(Name = "ЕжегодныйОтпускОценочныеОбязательстваИРезервыНУ", Comment = "", Synonym = "Отпуск за счет обязательств и резервов (НУ)")]
        ЕжегодныйОтпускОценочныеОбязательстваИРезервыНУ,
        [Description1C8(Name = "ЕжегодныйОтпускОценочныеОбязательстваИРезервы", Comment = "", Synonym = "Ежегодный отпуск за счет оценочных обязательств и резервов")]
        ЕжегодныйОтпускОценочныеОбязательстваИРезервы,
        [Description1C8(Name = "ЕжегодныйОтпускРезервы", Comment = "", Synonym = "Ежегодный отпуск за счет резервов")]
        ЕжегодныйОтпускРезервы,
        [Description1C8(Name = "КомпенсацияЕжегодногоОтпуска", Comment = "", Synonym = "Компенсация ежегодного отпуска")]
        КомпенсацияЕжегодногоОтпуска,
        [Description1C8(Name = "КомпенсацияЕжегодногоОтпускаОценочныеОбязательства", Comment = "", Synonym = "Компенсация ежегодного отпуска за счет оценочных обязательств")]
        КомпенсацияЕжегодногоОтпускаОценочныеОбязательства,
        [Description1C8(Name = "ПрочиеРасчетыСПерсоналом", Comment = "", Synonym = "Прочие расчеты с персоналом")]
        ПрочиеРасчетыСПерсоналом,
        [Description1C8(Name = "ВоенныйСбор", Comment = "", Synonym = "Военный сбор")]
        ВоенныйСбор,
        [Description1C8(Name = "ВСДоходыКонтрагентов", Comment = "", Synonym = "ВС с доходов контрагентов")]
        ВСДоходыКонтрагентов
    }
}
