using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "ВидыОсобыхНачисленийИУдержаний", Comment = "", Synonym = "Виды особых начислений и удержаний")]
    public enum ВидыОсобыхНачисленийИУдержаний
    {
        [Description1C8(Name = "Дивиденды", Comment = "", Synonym = "Дивиденды")]
        Дивиденды,
        [Description1C8(Name = "ДивидендыСотрудников", Comment = "", Synonym = "Дивиденды сотрудников")]
        ДивидендыСотрудников,
        [Description1C8(Name = "ДоговорАвторскогоЗаказа", Comment = "", Synonym = "Договор авторского заказа")]
        ДоговорАвторскогоЗаказа,
        [Description1C8(Name = "ДоговорРаботыУслуги", Comment = "", Synonym = "Договор (работы, услуги)")]
        ДоговорРаботыУслуги,
        [Description1C8(Name = "ДСВРаботодателя", Comment = "", Synonym = "Страховые взносы на накопительную часть пенсии, перечисленные работодателем")]
        ДСВРаботодателя,
        [Description1C8(Name = "КомпенсацияЗаЗадержкуЗарплаты", Comment = "", Synonym = "Компенсация за задержку зарплаты")]
        КомпенсацияЗаЗадержкуЗарплаты,
        [Description1C8(Name = "МатериальнаяВыгодаПоЗаймам", Comment = "", Synonym = "Материальная выгода по займам (кредитам)")]
        МатериальнаяВыгодаПоЗаймам,
        [Description1C8(Name = "УдалитьМатериальнаяПомощь", Comment = "", Synonym = "Удалить материальная помощь")]
        УдалитьМатериальнаяПомощь,
        [Description1C8(Name = "НачисленоПроцентовПоЗайму", Comment = "", Synonym = "Начислено процентов по займу")]
        НачисленоПроцентовПоЗайму,
        [Description1C8(Name = "НДФЛ", Comment = "", Synonym = "НДФЛ")]
        НДФЛ,
        [Description1C8(Name = "НДФЛДоначисленныйПоРезультатамПроверки", Comment = "", Synonym = "НДФЛ, доначисленный по результатам проверки")]
        НДФЛДоначисленныйПоРезультатамПроверки,
        [Description1C8(Name = "НДФЛДоходыКонтрагентов", Comment = "", Synonym = "НДФЛ с доходов контрагентов")]
        НДФЛДоходыКонтрагентов,
        [Description1C8(Name = "НДФЛЗачтено", Comment = "", Synonym = "Зачтено излишне удержанного НДФЛ")]
        НДФЛЗачтено,
        [Description1C8(Name = "НДФЛКЗачету", Comment = "", Synonym = "НДФЛ к зачету в счет будущих платежей")]
        НДФЛКЗачету,
        [Description1C8(Name = "НДФЛПередачаЗадолженностиВНалоговыйОрган", Comment = "", Synonym = "НДФЛ передача задолженности в налоговый орган")]
        НДФЛПередачаЗадолженностиВНалоговыйОрган,
        [Description1C8(Name = "НДФЛПрочиеРасчетыСПерсоналом", Comment = "", Synonym = "НДФЛ с доходов по прочим операциям с персоналом")]
        НДФЛПрочиеРасчетыСПерсоналом,
        [Description1C8(Name = "НДФЛРасчетыСБывшимиСотрудниками", Comment = "", Synonym = "НДФЛ расчеты с бывшими сотрудниками")]
        НДФЛРасчетыСБывшимиСотрудниками,
        [Description1C8(Name = "НФДЛДивиденды", Comment = "", Synonym = "НДФЛ с дивидендов")]
        НФДЛДивиденды,
        [Description1C8(Name = "НФДЛДивидендыСотрудникам", Comment = "", Synonym = "НДФЛ с дивидендов работникам")]
        НФДЛДивидендыСотрудникам,
        [Description1C8(Name = "ПогашениеЗаймаИзЗарплаты", Comment = "", Synonym = "Погашение займа из зарплаты")]
        ПогашениеЗаймаИзЗарплаты,
        [Description1C8(Name = "ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности", Comment = "", Synonym = "Пособие при постановке на учет в ранние сроки беременности")]
        ПособиеПриПостановкеНаУчетВРанниеСрокиБеременности,
        [Description1C8(Name = "ПособиеПриРожденииРебенка", Comment = "", Synonym = "Пособие при рождении ребенка")]
        ПособиеПриРожденииРебенка,
        [Description1C8(Name = "ПроцентыПоЗайму", Comment = "", Synonym = "Проценты по займу")]
        ПроцентыПоЗайму,
        [Description1C8(Name = "СтоимостьПодарковПризов", Comment = "", Synonym = "Стоимость подарков и призов")]
        СтоимостьПодарковПризов,
        [Description1C8(Name = "ПособиеНаПогребение", Comment = "", Synonym = "Пособие на погребение")]
        ПособиеНаПогребение,
        [Description1C8(Name = "ВоенныйСбор", Comment = "", Synonym = "Военный сбор")]
        ВоенныйСбор,
        [Description1C8(Name = "ВСДоходыКонтрагентов", Comment = "", Synonym = "ВС с доходов контрагентов")]
        ВСДоходыКонтрагентов
    }
}
