using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "КатегорииНачисленийИНеоплаченногоВремени", Comment = "", Synonym = "Категории начислений и неоплаченного времени")]
    public enum КатегорииНачисленийИНеоплаченногоВремени
    {
        [Description1C8(Name = "ПовременнаяОплатаТруда", Comment = "", Synonym = "Повременная оплата труда и надбавки")]
        ПовременнаяОплатаТруда,
        [Description1C8(Name = "ОплатаПоДоговоруГПХ", Comment = "", Synonym = "Оплата по договору ГПХ")]
        ОплатаПоДоговоруГПХ,
        [Description1C8(Name = "Доплата", Comment = "", Synonym = "Доплата")]
        Доплата,
        [Description1C8(Name = "СдельнаяОплатаТруда", Comment = "", Synonym = "Сдельная оплата труда")]
        СдельнаяОплатаТруда,
        [Description1C8(Name = "ОплатаТрудаВНатуральнойФорме", Comment = "", Synonym = "Оплата труда в натуральной форме")]
        ОплатаТрудаВНатуральнойФорме,
        [Description1C8(Name = "ДоходВНатуральнойФорме", Comment = "", Synonym = "Доход в натуральной форме")]
        ДоходВНатуральнойФорме,
        [Description1C8(Name = "КомпенсационныеВыплаты", Comment = "", Synonym = "Компенсационные выплаты")]
        КомпенсационныеВыплаты,
        [Description1C8(Name = "Премия", Comment = "", Synonym = "Премия")]
        Премия,
        [Description1C8(Name = "РайонныйКоэффициент", Comment = "", Synonym = "Районный коэффициент")]
        РайонныйКоэффициент,
        [Description1C8(Name = "СевернаяНадбавка", Comment = "", Synonym = "Северная надбавка")]
        СевернаяНадбавка,
        [Description1C8(Name = "ДенежноеСодержаниеНаПериодОтпуска", Comment = "", Synonym = "Денежное содержание на период отпуска")]
        ДенежноеСодержаниеНаПериодОтпуска,
        [Description1C8(Name = "ДенежноеСодержаниеКомпенсацияОтпуска", Comment = "", Synonym = "Денежное содержание компенсация отпуска")]
        ДенежноеСодержаниеКомпенсацияОтпуска,
        [Description1C8(Name = "Индексация", Comment = "", Synonym = "Индексация зарплаты")]
        Индексация,
        [Description1C8(Name = "КомпенсацияОтпуска", Comment = "", Synonym = "Компенсация отпуска")]
        КомпенсацияОтпуска,
        [Description1C8(Name = "ЕдиновременнаяВыплатаКОтпускуГосслужащего", Comment = "", Synonym = "Единовременная выплата к отпуску госслужащего")]
        ЕдиновременнаяВыплатаКОтпускуГосслужащего,
        [Description1C8(Name = "ЕдиновременнаяВыплатаКОтпуску", Comment = "", Synonym = "Единовременная выплата к отпуску")]
        ЕдиновременнаяВыплатаКОтпуску,
        [Description1C8(Name = "МатериальнаяПомощьПриОтпускеГосслужащего", Comment = "", Synonym = "Материальная помощь к отпуску госслужащего")]
        МатериальнаяПомощьПриОтпускеГосслужащего,
        [Description1C8(Name = "МатериальнаяПомощьПриОтпуске", Comment = "", Synonym = "Материальная помощь к отпуску")]
        МатериальнаяПомощьПриОтпуске,
        [Description1C8(Name = "ДоплатаДоМЗП", Comment = "", Synonym = "Доплата до МЗП")]
        ДоплатаДоМЗП,
        [Description1C8(Name = "НеявкаПоНевыясненнымПричинам", Comment = "", Synonym = "Неявка по невыясненным причинам")]
        НеявкаПоНевыясненнымПричинам,
        [Description1C8(Name = "Прогул", Comment = "", Synonym = "Прогул")]
        Прогул,
        [Description1C8(Name = "ПростойПоВинеРаботника", Comment = "", Synonym = "Простой по вине работника")]
        ПростойПоВинеРаботника,
        [Description1C8(Name = "ОплатаПростояПоВинеРаботодателя", Comment = "", Synonym = "Оплата простоя по вине работодателя")]
        ОплатаПростояПоВинеРаботодателя,
        [Description1C8(Name = "ОплатаПростояПоНезависящимОтРаботодателяПричинам", Comment = "", Synonym = "Оплата простоя по независящим от работодателя причинам")]
        ОплатаПростояПоНезависящимОтРаботодателяПричинам,
        [Description1C8(Name = "ДенежноеСодержаниеНаПериодКомандировки", Comment = "", Synonym = "Денежное содержание на период командировки")]
        ДенежноеСодержаниеНаПериодКомандировки,
        [Description1C8(Name = "ОплатаКомандировки", Comment = "", Synonym = "Оплата командировки")]
        ОплатаКомандировки,
        [Description1C8(Name = "СохраняемоеДенежноеСодержание", Comment = "", Synonym = "Сохраняемое денежное содержание")]
        СохраняемоеДенежноеСодержание,
        [Description1C8(Name = "ОплатаПоСреднемуЗаработку", Comment = "", Synonym = "Оплата времени сохраняемого среднего заработка")]
        ОплатаПоСреднемуЗаработку,
        [Description1C8(Name = "ДоплатаДоСреднегоЗаработка", Comment = "", Synonym = "Доплата до среднего заработка")]
        ДоплатаДоСреднегоЗаработка,
        [Description1C8(Name = "ОплатаОтпуска", Comment = "", Synonym = "Оплата отпуска")]
        ОплатаОтпуска,
        [Description1C8(Name = "ОтпускБезОплаты", Comment = "", Synonym = "Отпуск без оплаты")]
        ОтпускБезОплаты,
        [Description1C8(Name = "ОплатаБольничногоЛиста", Comment = "", Synonym = "Оплата больничного листа")]
        ОплатаБольничногоЛиста,
        [Description1C8(Name = "ОплатаБольничногоПрофзаболевание", Comment = "", Synonym = "Оплата больничного листа, профзаболевание")]
        ОплатаБольничногоПрофзаболевание,
        [Description1C8(Name = "ОплатаБольничногоЛистаЗаСчетРаботодателя", Comment = "", Synonym = "Оплата больничного листа за счет работодателя")]
        ОплатаБольничногоЛистаЗаСчетРаботодателя,
        [Description1C8(Name = "ДоплатаДоСреднегоЗаработкаЗаДниБолезни", Comment = "", Synonym = "Доплата до среднего заработка за дни болезни")]
        ДоплатаДоСреднегоЗаработкаЗаДниБолезни,
        [Description1C8(Name = "ОплатаДнейУходаЗаДетьмиИнвалидами", Comment = "", Synonym = "ѳ(не украинский) Оплата дней ухода за детьми-инвалидами")]
        ОплатаДнейУходаЗаДетьмиИнвалидами,
        [Description1C8(Name = "ПособиеПоУходуЗаРебенкомДоПолутораЛет", Comment = "", Synonym = "Отпуск по уходу за ребенком до шести лет")]
        ПособиеПоУходуЗаРебенкомДоПолутораЛет,
        [Description1C8(Name = "ПособиеПоУходуЗаРебенкомДоТрехЛет", Comment = "", Synonym = "Отпуск по уходу за ребенком до трех лет")]
        ПособиеПоУходуЗаРебенкомДоТрехЛет,
        [Description1C8(Name = "ВыходноеПособиеМесячноеДенежноеСодержание", Comment = "", Synonym = "Выходное пособие (месячное денежное содержание)")]
        ВыходноеПособиеМесячноеДенежноеСодержание,
        [Description1C8(Name = "ВыходноеПособие", Comment = "", Synonym = "Выходное пособие")]
        ВыходноеПособие,
        [Description1C8(Name = "ДоплатаЗаСовмещение", Comment = "", Synonym = "Доплата за совмещение")]
        ДоплатаЗаСовмещение,
        [Description1C8(Name = "БолезньБезОплаты", Comment = "", Synonym = "Болезнь без оплаты")]
        БолезньБезОплаты,
        [Description1C8(Name = "ОтпускПоБеременностиИРодамБезОплаты", Comment = "", Synonym = "Отпуск по беременности и родам без оплаты")]
        ОтпускПоБеременностиИРодамБезОплаты,
        [Description1C8(Name = "ОплатаБольничногоНесчастныйСлучайНаПроизводстве", Comment = "", Synonym = "Оплата больничного листа, несчастный случай на производстве")]
        ОплатаБольничногоНесчастныйСлучайНаПроизводстве,
        [Description1C8(Name = "ОтпускПоБеременностиИРодам", Comment = "", Synonym = "Отпуск по беременности и родам")]
        ОтпускПоБеременностиИРодам,
        [Description1C8(Name = "ОтпускПоУходуЗаРебенкомДо3Лет", Comment = "", Synonym = "Отпуск по уходу за ребенком до 3 лет")]
        ОтпускПоУходуЗаРебенкомДо3Лет,
        [Description1C8(Name = "ОтпускПоУходуЗаРебенкомДо6Лет", Comment = "", Synonym = "Отпуск по уходу за ребенком до 6 лет")]
        ОтпускПоУходуЗаРебенкомДо6Лет,
        [Description1C8(Name = "НачисленияМобилизованным", Comment = "", Synonym = "Начисления мобилизованным")]
        НачисленияМобилизованным,
        [Description1C8(Name = "ПрогулИлиНеявка", Comment = "", Synonym = "Прогул или неявка")]
        ПрогулИлиНеявка,
        [Description1C8(Name = "ЗаработокНаВремяТрудоустройства", Comment = "", Synonym = "Заработок на время трудоустройства")]
        ЗаработокНаВремяТрудоустройства,
        [Description1C8(Name = "МатериальнаяПомощь", Comment = "", Synonym = "Материальная помощь")]
        МатериальнаяПомощь,
        [Description1C8(Name = "Льгота", Comment = "", Synonym = "Льгота")]
        Льгота,
        [Description1C8(Name = "НадбавкаЗаВредность", Comment = "", Synonym = "Надбавка за вредность")]
        НадбавкаЗаВредность,
        [Description1C8(Name = "ОтпускНаСанаторноКурортноеЛечение", Comment = "", Synonym = "Отпуск (за счет ФСС) на период санаторно-курортного лечения")]
        ОтпускНаСанаторноКурортноеЛечение,
        [Description1C8(Name = "Отгул", Comment = "", Synonym = "Отгул")]
        Отгул,
        [Description1C8(Name = "ОплатаПредыдущимиДокументами", Comment = "", Synonym = "Оплата предыдущими документами")]
        ОплатаПредыдущимиДокументами,
        [Description1C8(Name = "Прочее", Comment = "", Synonym = "Прочие начисления и выплаты")]
        Прочее,
        [Description1C8(Name = "ДоплатаДоДенежногоСодержанияЗаДниБолезни", Comment = "", Synonym = "Доплата до денежного содержания за дни болезни")]
        ДоплатаДоДенежногоСодержанияЗаДниБолезни
    }
}
