using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "КатегорииДолжностейДляУчетаЗабронированных", Comment = "", Synonym = "Категории должностей для учета забронированных")]
    public enum КатегорииДолжностейДляУчетаЗабронированных
    {
        [Description1C8(Name = "Руководители", Comment = "", Synonym = "Руководители")]
        Руководители,
        [Description1C8(Name = "СпециалистыСХ", Comment = "", Synonym = "Специалисты сельского хозяйства")]
        СпециалистыСХ,
        [Description1C8(Name = "СпециалистыПолезныеИскопаемые", Comment = "", Synonym = "Специалисты по ВЭД Добыча полезных ископаемых")]
        СпециалистыПолезныеИскопаемые,
        [Description1C8(Name = "СпециалистыОбрабатывающиеПроизводства", Comment = "", Synonym = "Специалисты по ВЭД Обрабатывающие производства")]
        СпециалистыОбрабатывающиеПроизводства,
        [Description1C8(Name = "СпециалистыПроизводствоЭлектроэнергии", Comment = "", Synonym = "Специалисты по ВЭД Производство и распределение электро-энергии, газа и воды")]
        СпециалистыПроизводствоЭлектроэнергии,
        [Description1C8(Name = "СпециалистыСтроительство", Comment = "", Synonym = "Специалисты по ВЭД Строительство")]
        СпециалистыСтроительство,
        [Description1C8(Name = "СпециалистыТранспорт", Comment = "", Synonym = "Специалисты по ВЭД Транспорт и связь")]
        СпециалистыТранспорт,
        [Description1C8(Name = "СпециалистыОбразования", Comment = "", Synonym = "Специалисты по ВЭД Образование, включая студентов, курсантов и пр.")]
        СпециалистыОбразования,
        [Description1C8(Name = "СпециалистыЗдравоохранение", Comment = "", Synonym = "Специалисты по ВЭД Здравоохранение и предоставление социальных услуг")]
        СпециалистыЗдравоохранение,
        [Description1C8(Name = "ПрочиеСпециалисты", Comment = "", Synonym = "Специалисты, работающие в прочих видах экономической деятельности")]
        ПрочиеСпециалисты,
        [Description1C8(Name = "ДругиеСлужащие", Comment = "", Synonym = "Другие служащие (делопроизводители, секретари и др. )")]
        ДругиеСлужащие,
        [Description1C8(Name = "РабочиеИмеющиеТарифныйРазряд", Comment = "", Synonym = "Рабочие имеющие тарифный разряд")]
        РабочиеИмеющиеТарифныйРазряд,
        [Description1C8(Name = "РабочиеНеИмеющиеТарифныхРазрядов", Comment = "", Synonym = "Рабочие не имеющие тарифных разрядов")]
        РабочиеНеИмеющиеТарифныхРазрядов,
        [Description1C8(Name = "РабочиеСХ", Comment = "", Synonym = "Рабочие сельскохозяйственного производства")]
        РабочиеСХ,
        [Description1C8(Name = "РабочиеЛокомотивныхБригад", Comment = "", Synonym = "Рабочие локомотивных бригад")]
        РабочиеЛокомотивныхБригад,
        [Description1C8(Name = "Водители", Comment = "", Synonym = "Водители")]
        Водители,
        [Description1C8(Name = "Трактористы", Comment = "", Synonym = "Трактористы")]
        Трактористы
    }
}
