using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "РазделыУчетаДляВводаОстатков", Comment = "", Synonym = "Разделы учета для ввода остатков")]
    public enum РазделыУчетаДляВводаОстатков
    {
        [Description1C8(Name = "ОсновныеСредства", Comment = "", Synonym = "Основные средства (счета 10, 11, 13, 286)")]
        ОсновныеСредства,
        [Description1C8(Name = "МалоценныеАктивыВЭксплуатации", Comment = "", Synonym = "Малоценные активы в эксплуатации (счета 1112, 1122, 1322, МЦ)")]
        МалоценныеАктивыВЭксплуатации,
        [Description1C8(Name = "НематериальныеАктивы", Comment = "", Synonym = "Нематериальные активы (счета 12, 133)")]
        НематериальныеАктивы,
        [Description1C8(Name = "КапитальныеИнвестиции", Comment = "", Synonym = "Капитальные инвестиции (счета 15 (кроме 155))")]
        КапитальныеИнвестиции,
        [Description1C8(Name = "ЗапасыСебестоимость", Comment = "", Synonym = "Запасы по себестоимости (счета 201-205, 207-209, 221, 234, 25, 26, 27, 281, 284, 289, 08)")]
        ЗапасыСебестоимость,
        [Description1C8(Name = "ТранспортноЗаготовительныеРасходыНаОтдельныхСубсчетах", Comment = "", Synonym = "Транспортно заготовительные расходы (200, 2801, 2802)")]
        ТранспортноЗаготовительныеРасходыНаОтдельныхСубсчетах,
        [Description1C8(Name = "ЗапасыПереданные", Comment = "", Synonym = "Запасы переданные (счета 206, 283)")]
        ЗапасыПереданные,
        [Description1C8(Name = "НезавершенноеПроизводство", Comment = "", Synonym = "Незавершенное производство (счета 231 – 233)")]
        НезавершенноеПроизводство,
        [Description1C8(Name = "ТоварыПоПродажнойЦене", Comment = "", Synonym = "Товары по продажной цене (счета 282, 285)")]
        ТоварыПоПродажнойЦене,
        [Description1C8(Name = "ДенежныеСредства", Comment = "", Synonym = "Денежные средства (счета 30, 31, 333, 334)")]
        ДенежныеСредства,
        [Description1C8(Name = "ВзаиморасчетыСКонтрагентами", Comment = "", Synonym = "Взаиморасчеты с контрагентами (счета 36, 371, 3771, 3772, 63, 681, 6851, 6852, 643, 644)")]
        ВзаиморасчетыСКонтрагентами,
        [Description1C8(Name = "ВзаиморасчетыСПодотчетнымиЛицами", Comment = "", Synonym = "Взаиморасчеты с подотчетными лицами (счет 372)")]
        ВзаиморасчетыСПодотчетнымиЛицами,
        [Description1C8(Name = "РасходыБудущихПериодов", Comment = "", Synonym = "Расходы будущих периодов (счет 39)")]
        РасходыБудущихПериодов,
        [Description1C8(Name = "ЗарплатаИОтчисления", Comment = "", Synonym = "Зарплата и отчисления (счета 65, 66)")]
        ЗарплатаИОтчисления,
        [Description1C8(Name = "ТоварыНаКомиссии", Comment = "", Synonym = "Товары, принятые на комиссию (счета 024)")]
        ТоварыНаКомиссии,
        [Description1C8(Name = "ПрочиеСчетаБухгалтерскогоУчета", Comment = "", Synonym = "Прочие счета бухгалтерского учета")]
        ПрочиеСчетаБухгалтерскогоУчета,
        [Description1C8(Name = "ОтсроченныеНалоговыеАктивыИОбязательства", Comment = "", Synonym = "(не используется) ОНА и ОНО (счета 17, 54)")]
        ОтсроченныеНалоговыеАктивыИОбязательства,
        [Description1C8(Name = "ДанныеНалоговогоУчета", Comment = "", Synonym = "(не используется) Данные налогового учета (по налогу на прибыль до 01.04.2011) ")]
        ДанныеНалоговогоУчета,
        [Description1C8(Name = "ГруппыОСНалоговыйУчет", Comment = "", Synonym = "(не используется) Группы основных средств (налоговый учет до 01.04.2011)")]
        ГруппыОСНалоговыйУчет
    }
}
