using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "РазделыУчетаДляКорректировкиОстатковНКУна01042011", Comment = "", Synonym = "Разделы учета для корректировки остатков в связи с вступлением в силу норм НКУ (01.04.2011)")]
    public enum РазделыУчетаДляКорректировкиОстатковНКУна01042011
    {
        [Description1C8(Name = "ОсновныеСредства", Comment = "", Synonym = "Основные средства (счета 10, 11, 13)")]
        ОсновныеСредства,
        [Description1C8(Name = "МалоценныеАктивыВЭксплуатации", Comment = "", Synonym = "Малоценные активы в эксплуатации (счета 1112, 1122, 1322, МЦ)")]
        МалоценныеАктивыВЭксплуатации,
        [Description1C8(Name = "НематериальныеАктивы", Comment = "", Synonym = "Нематериальные активы (счета 12, 133)")]
        НематериальныеАктивы,
        [Description1C8(Name = "КапитальныеИнвестиции", Comment = "", Synonym = "Капитальные инвестиции (счета 151-154, 235, кроме 1521, 1531)")]
        КапитальныеИнвестиции,
        [Description1C8(Name = "ЗапасыСебестоимость", Comment = "", Synonym = "Запасы по себестоимости (счета 1521, 1531, 201-205, 207-209, 221, 234, 25, 26, 27, 281, 284, 286, 289)")]
        ЗапасыСебестоимость,
        [Description1C8(Name = "ТранспортноЗаготовительныеРасходыНаОтдельныхСубсчетах", Comment = "", Synonym = "Транспортно заготовительные расходы (200, 280)")]
        ТранспортноЗаготовительныеРасходыНаОтдельныхСубсчетах,
        [Description1C8(Name = "ЗапасыПереданные", Comment = "", Synonym = "Запасы переданные (счета 206, 283)")]
        ЗапасыПереданные,
        [Description1C8(Name = "НезавершенноеПроизводство", Comment = "", Synonym = "Незавершенное производство (счета 231–233, 24)")]
        НезавершенноеПроизводство,
        [Description1C8(Name = "ТоварыПоПродажнойЦене", Comment = "", Synonym = "Товары по продажной цене (счета 282, 285)")]
        ТоварыПоПродажнойЦене,
        [Description1C8(Name = "РасходыБудущихПериодов", Comment = "", Synonym = "Расходы будущих периодов (счет 39)")]
        РасходыБудущихПериодов
    }
}
