using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "СлучаиУходаЗаБольнымиДетьми", Comment = "", Synonym = "Случаи ухода за больными детьми")]
    public enum СлучаиУходаЗаБольнымиДетьми
    {
        [Description1C8(Name = "ПоУходуДо7миЛетАмбулаторно", Comment = "с 1.1.2007", Synonym = "(09) До 7-ми лет, амбулаторно")]
        ПоУходуДо7миЛетАмбулаторно,
        [Description1C8(Name = "ПоУходуДо7миЛетВСтационаре", Comment = "с 1.1.2007", Synonym = "(09) До 7-ми лет, в стационаре")]
        ПоУходуДо7миЛетВСтационаре,
        [Description1C8(Name = "ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно", Comment = "", Synonym = "(12) До 7-ми лет, амбулаторно, заболевание включено в Перечень")]
        ПоУходуДо7миЛетПриОсобомЗаболеванииАмбулаторно,
        [Description1C8(Name = "ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре", Comment = "", Synonym = "(12) До 7-ми лет, в стационаре, при заболевании, включенном в Перечень")]
        ПоУходуДо7миЛетПриОсобомЗаболеванииВСтационаре,
        [Description1C8(Name = "ПоУходуДо15тиЛетАмбулаторно", Comment = "", Synonym = "(09) От 7 до 15-ти лет, амбулаторно")]
        ПоУходуДо15тиЛетАмбулаторно,
        [Description1C8(Name = "ПоУходуДо15тиЛетВСтационаре", Comment = "", Synonym = "(09) От 7 до 15-ти лет, в стационаре")]
        ПоУходуДо15тиЛетВСтационаре,
        [Description1C8(Name = "ПоУходуЗаРебенкомИнвалидомАмбулаторно", Comment = "", Synonym = "(13) Инвалидом до 18-ти лет, амбулаторно (до 2015 года - до 15-ти лет)")]
        ПоУходуЗаРебенкомИнвалидомАмбулаторно,
        [Description1C8(Name = "ПоУходуЗаРебенкомИнвалидомВСтационаре", Comment = "", Synonym = "(13) Инвалидом до 18-ти лет, в стационаре (до 2015 года - до 15-ти лет)")]
        ПоУходуЗаРебенкомИнвалидомВСтационаре,
        [Description1C8(Name = "ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно", Comment = "", Synonym = "(14) До 18-ти лет при поствакцинальном осложнении, амбулаторно (до 2015 года - до 15-ти лет)")]
        ПоУходуДо15тиЛетПриПоствакцинальномОсложненииАмбулаторно,
        [Description1C8(Name = "ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре", Comment = "", Synonym = "(14) До 18-ти лет при поствакцинальном осложнении, в стационаре (до 2015 года - до 15-ти лет)")]
        ПоУходуДо15тиЛетПриПоствакцинальномОсложненииВСтационаре,
        [Description1C8(Name = "ПоУходуДо15тиЛетПриВИЧ", Comment = "", Synonym = "(15) До 18-ти лет, ВИЧ-инфицированным, в стационаре (до 2015 года - до 15-ти лет)")]
        ПоУходуДо15тиЛетПриВИЧ
    }
}
