using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "СостоянияСотрудника", Comment = "", Synonym = "Состояния сотрудника")]
    public enum СостоянияСотрудника
    {
        [Description1C8(Name = "Работа", Comment = "", Synonym = "Работа")]
        Работа,
        [Description1C8(Name = "РаботаВОтпускеПоУходуЗаРебенком", Comment = "", Synonym = "Работа в отпуске по уходу за ребенком")]
        РаботаВОтпускеПоУходуЗаРебенком,
        [Description1C8(Name = "Прогул", Comment = "", Synonym = "Прогул")]
        Прогул,
        [Description1C8(Name = "ВынужденныйПрогул", Comment = "", Synonym = "Вынужденный прогул")]
        ВынужденныйПрогул,
        [Description1C8(Name = "ПростойПоВинеРаботника", Comment = "", Synonym = "Простой по вине работника")]
        ПростойПоВинеРаботника,
        [Description1C8(Name = "ПростойПоВинеРаботодателя", Comment = "", Synonym = "Простой по вине работодателя")]
        ПростойПоВинеРаботодателя,
        [Description1C8(Name = "ПростойНеЗависящийОтРаботодателяИРаботника", Comment = "", Synonym = "Простой, не зависящий от работодателя и работника")]
        ПростойНеЗависящийОтРаботодателяИРаботника,
        [Description1C8(Name = "ОтпускОсновной", Comment = "", Synonym = "Отпуск основной")]
        ОтпускОсновной,
        [Description1C8(Name = "ДополнительныйОтпуск", Comment = "", Synonym = "Дополнительный отпуск")]
        ДополнительныйОтпуск,
        [Description1C8(Name = "ДополнительныйОтпускНеоплачиваемый", Comment = "", Synonym = "Дополнительный отпуск (неоплачиваемый)")]
        ДополнительныйОтпускНеоплачиваемый,
        [Description1C8(Name = "ОтпускУчебныйОплачиваемый", Comment = "", Synonym = "Отпуск учебный оплачиваемый")]
        ОтпускУчебныйОплачиваемый,
        [Description1C8(Name = "ОтпускУчебныйНеоплачиваемый", Comment = "", Synonym = "Отпуск учебный неоплачиваемый")]
        ОтпускУчебныйНеоплачиваемый,
        [Description1C8(Name = "ОтпускНеоплачиваемыйПоРазрешениюРаботодателя", Comment = "", Synonym = "Отпуск неоплачиваемый по разрешению работодателя")]
        ОтпускНеоплачиваемыйПоРазрешениюРаботодателя,
        [Description1C8(Name = "ОтпускНеоплачиваемыйПоЗаконодательству", Comment = "", Synonym = "Отпуск неоплачиваемый по законодательству")]
        ОтпускНеоплачиваемыйПоЗаконодательству,
        [Description1C8(Name = "ОтпускПоУходуЗаРебенком", Comment = "", Synonym = "Отпуск по уходу за ребенком до 3 лет")]
        ОтпускПоУходуЗаРебенком,
        [Description1C8(Name = "Командировка", Comment = "", Synonym = "Командировка")]
        Командировка,
        [Description1C8(Name = "ОтсутствиеССохранениемОплаты", Comment = "", Synonym = "Отсутствие с сохранением оплаты")]
        ОтсутствиеССохранениемОплаты,
        [Description1C8(Name = "ВыполнениеГосударственныхОбязанностей", Comment = "", Synonym = "Выполнение государственных обязанностей")]
        ВыполнениеГосударственныхОбязанностей,
        [Description1C8(Name = "ДополнительныеВыходныеДниОплачиваемые", Comment = "", Synonym = "Дополнительные выходные дни (оплачиваемые)")]
        ДополнительныеВыходныеДниОплачиваемые,
        [Description1C8(Name = "ДополнительныеВыходныеДниНеОплачиваемые", Comment = "", Synonym = "Дополнительные выходные дни не оплачиваемые")]
        ДополнительныеВыходныеДниНеОплачиваемые,
        [Description1C8(Name = "ОтсутствиеПоНевыясненнымПричинам", Comment = "", Synonym = "Отсутствие по невыясненным причинам")]
        ОтсутствиеПоНевыясненнымПричинам,
        [Description1C8(Name = "ОтпускПоБеременностиИРодам", Comment = "", Synonym = "Отпуск по беременности и родам")]
        ОтпускПоБеременностиИРодам,
        [Description1C8(Name = "ОтпускНаСанаторноКурортноеЛечение", Comment = "", Synonym = "Отпуск на санаторно-курортное лечение")]
        ОтпускНаСанаторноКурортноеЛечение,
        [Description1C8(Name = "Болезнь", Comment = "", Synonym = "Болезнь")]
        Болезнь,
        [Description1C8(Name = "БолезньБезОплаты", Comment = "", Synonym = "Болезнь без оплаты")]
        БолезньБезОплаты,
        [Description1C8(Name = "Факт", Comment = "", Synonym = "Факт")]
        Факт,
        [Description1C8(Name = "Увольнение", Comment = "", Synonym = "Увольнение")]
        Увольнение,
        [Description1C8(Name = "ОтпускПоУходуЗаРебенком6лет", Comment = "", Synonym = "Отпуск по уходу за ребенком до 6 лет")]
        ОтпускПоУходуЗаРебенком6лет
    }
}
