using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel.DataAnnotations;
using sabatex.V1C8.ComponentModel.DataAnnotations;
using sabatex.V1C8.Models;

namespace sabatex.V1C8.AccountingUkrCorp.Models.Enums
{
    [Description1C8(Name = "СпособыРасчетаНачислений", Comment = "", Synonym = "Способы расчета начислений")]
    public class СпособыРасчетаНачислений:EnumItem
    {
        public static readonly СпособыРасчетаНачислений ПоМесячнойТарифнойСтавкеПоЧасам = new СпособыРасчетаНачислений{Name= "ПоМесячнойТарифнойСтавкеПоЧасам",Synonim="По месячной тарифной ставке по часам",Comment="(Общ)"};
        public static readonly СпособыРасчетаНачислений ПроизвольнаяФормула = new СпособыРасчетаНачислений{Name= "ПроизвольнаяФормула",Synonim="Произвольная формула",Comment=""};
        public static readonly СпособыРасчетаНачислений ПоМесячнойТарифнойСтавкеПоДням = new СпособыРасчетаНачислений{Name= "ПоМесячнойТарифнойСтавкеПоДням",Synonim="По месячной тарифной ставке",Comment="(Общ)"};
        public static readonly СпособыРасчетаНачислений ПоДневнойТарифнойСтавке = new СпособыРасчетаНачислений{Name= "ПоДневнойТарифнойСтавке",Synonim="По дневной тарифной ставке",Comment="(Общ)"};
        public static readonly СпособыРасчетаНачислений ПоЧасовойТарифнойСтавке = new СпособыРасчетаНачислений{Name= "ПоЧасовойТарифнойСтавке",Synonim="По часовой тарифной ставке",Comment="(Общ)"};
        public static readonly СпособыРасчетаНачислений ФиксированнойСуммой = new СпособыРасчетаНачислений{Name= "ФиксированнойСуммой",Synonim="Фиксированной суммой",Comment="(Общ)"};
        public static readonly СпособыРасчетаНачислений Процентом = new СпособыРасчетаНачислений{Name= "Процентом",Synonim="Процентом",Comment="(Общ)"};
        public static readonly СпособыРасчетаНачислений ИндексацияЗарплаты = new СпособыРасчетаНачислений{Name= "ИндексацияЗарплаты",Synonim="Индексация зарплаты",Comment=""};
        public static readonly СпособыРасчетаНачислений ДоплатаДоСреднегоЗаработка = new СпособыРасчетаНачислений{Name= "ДоплатаДоСреднегоЗаработка",Synonim="Доплата до среднего заработка",Comment=""};
        public static readonly СпособыРасчетаНачислений ДоплатаДоСреднегоЗаработкаФСС = new СпособыРасчетаНачислений{Name= "ДоплатаДоСреднегоЗаработкаФСС",Synonim="Доплата до среднего заработка ФСС",Comment=""};
        public static readonly СпособыРасчетаНачислений ОплатаБольничного = new СпособыРасчетаНачислений{Name= "ОплатаБольничного",Synonim="Оплата больничного",Comment=""};
        public static readonly СпособыРасчетаНачислений ОплатаОтпускаПоКалендарнымДням = new СпособыРасчетаНачислений{Name= "ОплатаОтпускаПоКалендарнымДням",Synonim="Оплата отпуска по календарным дням",Comment=""};
        public static readonly СпособыРасчетаНачислений ОплатаОтпускаПоШестидневке = new СпособыРасчетаНачислений{Name= "ОплатаОтпускаПоШестидневке",Synonim="По среднему заработку для отпуска при расчете из рабочих дней",Comment=""};
        public static readonly СпособыРасчетаНачислений ОплатаПростоя = new СпособыРасчетаНачислений{Name= "ОплатаПростоя",Synonim="Оплата простоя",Comment=""};
        public static readonly СпособыРасчетаНачислений ПособиеПоУходуЗаРебенкомДоПолутораЛет = new СпособыРасчетаНачислений{Name= "ПособиеПоУходуЗаРебенкомДоПолутораЛет",Synonim="Пособие по уходу за ребенком до 1.5 лет",Comment=""};
        public static readonly СпособыРасчетаНачислений ДоплатаДоСохраняемогоДенежногоСодержанияЗаДниБолезни = new СпособыРасчетаНачислений{Name= "ДоплатаДоСохраняемогоДенежногоСодержанияЗаДниБолезни",Synonim="Доплата до сохраняемого денежного содержания за дни болезни",Comment=""};
        public static readonly СпособыРасчетаНачислений ДоплатаДоМЗП = new СпособыРасчетаНачислений{Name= "ДоплатаДоМЗП",Synonim="Доплата до МЗП",Comment=""};
        public static readonly СпособыРасчетаНачислений ИндексацияСоциальныхНачислений = new СпособыРасчетаНачислений{Name= "ИндексацияСоциальныхНачислений",Synonim="Индексация социальных начислений",Comment=""};
        public static readonly СпособыРасчетаНачислений НулеваяСумма = new СпособыРасчетаНачислений{Name= "НулеваяСумма",Synonim="Нулевая сумма",Comment=""};
        public static readonly СпособыРасчетаНачислений Индексация = new СпособыРасчетаНачислений{Name= "Индексация",Synonim="Индексация",Comment=""};
    }
}
